{
  "imagebaseurl": "https://tracy80s2003.github.io/",
  "name": "Tracy Golden",
  "role": "Digital Marketer",
  "cell": "708-921-2042",
  "email": "tracy80s2003@gmail.com",
  "linkedinId": "https://www.linkedin.com/in/tracy-golden/",
  "roleDescription": "I like dabbling in various parts of frontend development and like to learn about new technologies.",
  "socialLinks": [
    {
      "name": "linkedin",
      "url": "https://www.linkedin.com/in/tracy-golden/",
      "className": "fa fa-linkedin"
    },
    {
      "name": "github",
      "url": "https://tracy80s2003.github.io/",
      "className": "fa fa-github"
    }
  ],
  "aboutme": "Hi! My name is Tracy Golden. I am an experienced Digital Marketing Coordinator specializing in E-Mail Marketing with a demonstrated history of working in the information technology and services industry. Skilled in Marketing Automation Platforms, Microsoft products, HTML, Adobe Dreamweaver and Recruiting. Strong marketing professional graduated from Southern Illinois University Carbondale with a B.S. in Organizational Communication and a minor in Public Relations. Currently enrolled in the Northwestern University Coding Boot Camp—a 6-month, part-time program ending in late April 2021. I've been in marketing for many years but I've also been a Brand Ambassador where I've proudly represented large companies such as Abbott at the Chicago Marathon Expo, Nickelodeon at Slime Fest and Propel Water at the Color Run.",
  "address": "Northwest Chicago Suburbs",
  "website": "https://tracy80s2003.github.io/",
  "education": [
    {
      "UniversityName": "Southern Illinois University Carbondale",
      "specialization": "B.S. in Organizational Communication / Minor in Public Relations",
      "MonthOfPassing": "May",
      "YearOfPassing": "2010"
    }
  ],
  "work": [
    {
      "CompanyName": "ISACA",
      "specialization": "Digital Marketing Coordinator",
      "MonthOfStarting": "May",
      "YearOfStarting": "2016"
    },
    {
      "CompanyName": "CATI",
      "specialization": "Marketing Assistant",
      "MonthOfLeaving": "May",
      "YearOfLeaving": "2016"
    }
  ],
  "skills": [
    {
      "skillname": "HTML5"
    },
    {
      "skillname": "CSS"
    }
  ],
  "portfolio": [
    {
      "name": "Homework Assignment - Password Generator",
      "description": "Requirements included modifying starter code to create an application that enables employees to generate random passwords based on criteria that they’ve selected. This app will run in the browser and will feature dynamically updated HTML and CSS powered by JavaScript code that you write. It will have a clean and polished, responsive user interface that adapts to multiple screen sizes. User Story: As an employee with access to sensitive data we need to be able to randomly generate a password that meets certain criteria, so that we can create a strong password to provide greater security.",
      "imgurl": "public/images/password-generator.png",
      "repourl": "https://tracy80s2003.github.io/password-generator/",
      "projecturl": "https://github.com/tracy80s2003/password-generator"
    },
    {
      "name": "Homework Assignment - Work Day Scheduler",
      "description": "Requirements included creating a simple calendar application that allows a user to save events for each hour of the day by modifying starter code. This app will run in the browser and feature dynamically updated HTML and CSS powered by jQuery. User Story: As an employee with a busy schedule, I want to add important events to a daily planner so that I can manage my time effectively.",
      "imgurl": "public/images/workday_scheduler_screenshot.png"
    },
    {
      "name": "Project 1 - Beer Gourmet",
      "description": "Requirements included conceiving and executing a design that solves a real-world problem by integrating data received from multiple server-side API requests. This was a collaborative, team environment where we learned agile development methodologies and implemented feature and bug fixes using the git branch workflow and pull requests. User Story: As someone who is thirsty and hungry, this site will allow someone to search for beers from a selection of malts, hops or flavours. Hungry, no problem. A food-side is provided including the resturant venue.",
      "imgurl": "public/images/beer-gourmet-screenshot.png"
    },
    {
      "name": "Homework Assignment - README Generator",
      "description": "Requirements included creating a README file by using a command-line that dynamically generates a professional README.md file from a user's input using the Inquirer package. This allows the project creator to devote more time to working on the project. The application should be invoked by using the following command: node index.js. User Story: As a developer, I want a README generator so that I can quickly create a professional README for each new project.",
      "imgurl": "public/images/recording.gif"
    },
    {
      "name": "Project 2 - Jeopardy Trivia Game",
      "description": "Requirements included the following must-haves: use a Node and Express server, use Handlebars.js as the template engine, backed by a MySQL database with a Sequelize ORM, utilize both GET and POST routes for retrieving and adding new data, deployed using Heroku (with data) utilize at least one new library/package/or technology that we haven't discussed in class, a polished front-end/UI, a folder structure that meets the MVC paradigm, good quality coding standards and protect API keys in Node with environment variables. User Story: As a Jeopardy and/or trivia enthusiast, I want to play a game by creating a login, clicking the game option, and then I can keep track of my scores.",
      "imgurl": "images/portfolio/gameboard-screenshot.png"
    },
    {
      "name": "Homework Assignment - Budget Tracker",
      "description": "Requirements included the user being able to add expenses and deposits to their budget with or without a connection. When entering transactions offline, they should populate the total when brought back online. Giving users a fast and easy way to track their money is important, but allowing them to access that information anytime is even more important. Having offline functionality is paramount to our applications success.",
      "imgurl": "public/images/budget-tracker.gif"
    },
    {
      "name": "Project 3 - Worldy Meals",
      "description": "Requirements included the following must-haves: use ReactJS in some way (even if minimal), use a Node AND Express Web server, backed by a MySql OR MongoDB Database with a Sequelize or Mongoose ORM, both GET AND POST routes for retrieving and adding new data, deployed using Heroku (with data), utilize at least two libraries, packages, or technologies that we haven’t discussed, allow for or involve the authentication of users in some way, a polished frontend/UI, a folder structure that meets the MVC paradigm, meet good quality coding standards (indentation, scoping, naming) and must NOT expose sensitive API key information on the server. User Story: As a health-conscious consumer who enjoys cooking, I want a convenient, large international variety of quick and easy meal prep options with nutritional facts, and then I can pick up each meal kit which includes all the necessary ingredients to cook each meal.",
      "imgurl": "public/images/worldly-meals.gif"
    }
  ],
  "testimonials1": "Working with Tracy has always been wonderful. She is self-driven, knowledgeable in E-Mail Marketing and thrives in a collaborative environment. During my last two years at ISACA, I had the privilege of working with her on the Digital Marketing team. Tracy was a reliable colleague who was always more than happy to assist with any task that required her input. Aside from her strong background in Digital Marketing, Tracy is a very personable team-member and was someone that I always looked forward talking to. Tracy's work ethic and helpfulness are just some of the characteristics that would make her a great asset to any team.",
  "testimonials2": "Tracy is a great worker and gets along with everyone.",
  "contactMe": [
    {
      "name": "Tracy Golden",
      "cell": "708-921-2042",
      "Email": "tracy80s2003@gmail.com",
      "socialLinks": [
        {
          "name": "linkedin",
          "url": "https://www.linkedin.com/in/tracy-golden/",
          "className": "fa fa-linkedin"
        },
        {
          "name": "github",
          "url": "https://tracy80s2003.github.io/",
          "className": "fa fa-github"
        }
      ]
    }
  ] 
}